
// 第3章 練習問題3.12
package main
import (
	"os"
	"fmt"
)

func main() {
	if (len(os.Args) < 3) {
		return
	}

	fmt.Println(isAnagram(os.Args[1], os.Args[2]))
}

func isAnagram(s1, s2 string) bool {
	var j int

	/*----------------------------------------------------------*/
	/* 文字列長が異なるならアナグラムではないとする。			*/
	/*----------------------------------------------------------*/
	if ( len(s1) != len(s2) ) {
		return false
	}

	/*----------------------------------------------------------*/
	/* 全く同じ文字列はアナグラムではないとしておく。			*/
	/*----------------------------------------------------------*/
	if ( s1 == s2 ) {
		return false
	}

	for i := 0; i < len(s1); i++ {
		for j = 0; j < len(s2); j++ {
			if ( s1[i] == s2[j] ) { break }
		}

		/*------------------------------------------------------*/
		/* 同じ文字が見つからない。								*/
		/*------------------------------------------------------*/
		if ( j >= len(s2) ) {
			return false
		}

		/*------------------------------------------------------*/
		/* 文字列長が1で同じ文字。								*/
		/* 冒頭のif ( s1 == s2 ) ではじかれるが念のため。		*/
		/* 全く同じ文字列はアナグラムではないとしておく。		*/
		/*------------------------------------------------------*/
		/*
		if (len(s1) == 1) {
			//return true
			return false
		}
		*/

		/*------------------------------------------------------*/
		/* s2[j + 1:]でj + 1がlen(s2)以上かは見なくていい。		*/
		/* i側のループ上限で保証されるはず。					*/
		/*------------------------------------------------------*/
		//s2 = (s2[:j - 1] + s2[j + 1:])
		s2 = (s2[:j] + s2[j + 1:])
	}

	return true
}


